---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotFixProblem
source: html/08156d57-8838-3b9a-a3c1-f410eea2d25d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.CannotFixProblem Property

Failed to fix problem. Action has to be cancelled.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotFixProblem { get; }
```